Repository: nukeolay/susanin
Catalog: lib/l10n/intl_*.arb
Languages: ru, uk

# accuracy_details
source: location accuracy:
ru: точность определения геолокации:
uk: точність визначення геолокації:

source: current location
ru: текущее местоположение
uk: поточне розташування

# button_back_to_locations
source: Back to locations list
ru: К выбору локаций
uk: До вибору локацій

# button_edit_location
source: Edit
uk: Редагувати

source: latitude
ru: широта
uk: широта

source: longitude
ru: долгота
uk: довгота

# permission_request
source: Allow Susanin to access your location?
ru: Разрешить приложению доступ к определению геолокации?
uk: Дозволити застосунку доступ до визначення геолокації?

# button_deny
source: Deny
ru: Запретить
uk: Заборонити

# button_allow
source: Allow
ru: Разрешить
uk: Дозволити

# button_cancel
source: Cancel
ru: Отмена
uk: Скасування

# button_save
source: Save
ru: Сохранить
uk: Зберегти

# low_compass_accuracy
source: Poor compass accuracy:
ru: Низкая точность компаса:
uk: Низька точність компасу:

# normal_compass_accuracy
source: Good compass accuracy:
ru: Точность компаса высокая:
uk: Точность компаса высокая:

# compass_calibrate_instruction
source: Move the phone several times in space as shown on the screen to calibrate compass.
ru: Чтобы увеличить точность компаса, несколько раз переместите телефон в пространстве как указано выше.
uk: Щоб збільшити точність компаса, кілька разів перемістіть телефон у просторі, як зазначено вище.

# button_hide
source: Hide
ru: Свернуть
uk: Згорнути

# empty_locations_list
source: No saved locations. After saving the current location, you can select it from the list and get it`s direction and distance to it
ru: Нет сохраненных локаций. Сохраните локацию, после этого Вы сможете в любой момент в любом месте выбрать ее из списка и увидеть в каком направлении и на каком расстоянии от Вас она находится.
uk: Немає збережених локацій. Збережіть локацію, після цього Ви зможете у будь-який момент у будь-якому місці вибрати її зі списку та побачити у якому напрямку та на якій відстані від Вас вона знаходиться.

# date_format
source: MM-dd-yyyy
ru: dd-MM-yyyy
uk: dd-MM-yyyy

source: Delete location?
ru: Удалить локацию?
uk: Видалити локацію?

# button_yes
source: Yes
ru: Да
uk: Так

# button_no
source: No
ru: Нет
uk: Ні

# no_compass_distance_to_point
source: Distance to location:
ru: Расстояние до цели:
uk: Відстань до мети:

# no_compass_accuracy
source: Location accuracy:
ru: Точность определения геолокации:
uk: Точність визначення геолокації:

source: Compass not found
ru: Компас не обнаружен
uk: Компас не виявлено

# no_compass_bad_news_title
source: Bad news
ru: Плохие новости
uk: Погані новини

# no_compass_bad_news_text
source: Unfortunately, the application could not access the compass sensor, it may not be available in this device.
ru: К сожалению, приложение не смогло получить доступ к датчику компаса, возможно он отсутствует в данном устройстве.
uk: На жаль, програма не змогла отримати доступ до датчика компаса, можливо, він відсутній у цьому пристрої.

# no_compass_good_news_title
source: Good news
ru: Хорошие новости
uk: Гарні новини

# no_compass_good_news_text
source: Susanin still works, however, without indicating the direction. Will only show the distance to the target location.
ru: Сусанин все равно работает, правда, без указания направления. Будет показывать только расстояние до сохраненной локации.
uk: Сусанін все одно працює, щоправда, без зазначення напряму. Відображатиме лише відстань до збереженої локації.

source: Settings
ru: Настройки
uk: Налаштування

# button_instruction
source: Instruction
ru: Посмотреть инструкцию
uk: Переглянути інструкцію

source: Dark theme
ru: Темная тема
uk: Темна тема

source: Always on display
ru: Экран всегда включен
uk: Екран завжди увімкнений

# geolocation_permission
source: Request permission
ru: Доступ к геолокации
uk: Доступ до геолокації

# has_compass
source: Compass availability
ru: Наличие компаса в устройстве
uk: Наявність компаса у пристрої

# button_next
source: Next
ru: Далее
uk: Далі

# button_start
source: Start
ru: Начать
uk: Почати

# tutorial_title_1
source: Hello!
ru: Привет!
uk: Вітання!

# tutorial_text_1
source: I'll help you find the path to the saved location. No maps or internet access required. Only permission to get your location and compass sensor in this device. On the next screen, you can grant the necessary permissions.
ru: Я помогу тебе найти путь к сохраненной локации. Никаких карт и доступа к интернету не потребуется. Только разрешение на определение геолокации и наличие компаса в телефоне. На следующем экране ты сможешь выдать необходимые разрешения.
uk: Я допоможу тобі знайти шлях до збереженої локації. Жодних карт та доступу до інтернету не потрібно. Тільки дозвіл на визначення геолокації та наявність компаса в телефоні. На наступному екрані ти зможеш видати необхідні дозволи.

# tutorial_title_2
source: Settings
ru: Настройки
uk: Налаштування

# tutorial_title_3
source: Follow Susanin!
ru: Вперед за Сусаниным!
uk: Вперед за Сусаніним!

# tutorial_text_3
source: If all necessary permissions is granted and the compass in the device is working correctly, the pointer shows the direct direction to Hollywood and the distance to it. Now you can save the location you are in to find your way back to it.
ru: Если разрешение на доступ к геолокации выдано и компас в устройстве работает правильно, то указатель показывает прямое направление до Голливуда и расстояние до него. Теперь ты сможешь сохранять локацию на которой находишься, чтобы найти обратный путь к ней.
uk: Якщо дозвіл на доступ до геолокації видано і компас у пристрої працює правильно, то покажчик показує прямий напрямок до Голлівуду та відстань до нього. Тепер ти зможеш зберігати локацію на якій знаходишся, щоб знайти зворотний шлях до неї.

# tutorial_settings_permission
source: Acces to gelocation service is required.
ru: Для корректной работы приложения необходимо разрешение на определение геолокации.
uk: Для коректної роботи програми потрібний дозвіл на визначення геолокації.

# tutorial_settings_disabled
source: LOCATION SERVICE OFF Please turn on the location service to continue.
ru: СЕРВИС ГЕОЛОКАЦИИ ВЫКЛЮЧЕН Пожалуйста включите сервис геолокации, чтобы продолжить.
uk: СЕРВІС ГЕОЛОКАЦІЇ ВИКЛЮЧЕНО Будь ласка, увімкніть сервіс геолокації, щоб продовжити.

# tutorial_settings_no_compass
source: Unfortunately, the application was not allowed to access the compass, so Susanin will not be able to indicate the direction to the target, it will only show the distance to target location.
ru: К сожалению приложению не далось получить доступ к компасу, поэтому Сусанин не сможет указывать направление к цели, а будет показывать только расстояние до нее.
uk: На жаль додатку не далося отримати доступ до компасу, тому Сусанін не зможе вказувати напрямок до мети, а показуватиме лише відстань до неї.

# error_geolocation_permission
source: Permission not granted.
ru: Отсутствует доступ к сервису геолокации.
uk: Немає доступу до сервісу геолокації.

# error_geolocation_disabled
source: Geolocation service disabled.
ru: Cервис геолокации выключен
uk: Сервіс геолокації вимкнено

# error_title
source: Error
ru: Ошибка
uk: Помилка

# error_unknown
source: Unknown error
ru: Неизвестный сбой
uk: Невідомий збій

source: less than 5 m
ru: менее 5 м
uk: менше 5 м

# error_geolocation_permission_short
source: Permission not granted
ru: Разрешение не выдано
uk: Дозвіл не видано

source: location name
ru: название локации
uk: назва локації

# enter_name
source: Please enter location name
ru: Пожалуйста, введите название
uk: Будь ласка, введіть назву

source: Incorrect value
ru: Некорректное значение
uk: Некоректне значення

# distance_meters
source: {meters} m
ru: {meters} м
uk: {meters} м

# distance_kilometers
source: {meters} km
ru: {meters} км
uk: {meters} км

# ios_compass_settings_info
source: If the direction pointer does not rotate when you move your phone, you need to enable compass calibration: Settings -> Privacy -> Location Services -> System Services -> Compass Calibration.
ru: Если указатель компаса не вращается при перемещении телефона, необходимо включить калибровку компаса: Настройки -> Конфиденциальность -> Службы геолокации -> Системные службы -> Калибровка компаса.
uk: Якщо вказівник компаса не обертається під час переміщення телефону, необхідно ввімкнути калібрування компаса: Налаштування -> Конфіденційність -> Служби геолокації -> Системні служби -> Калібрування компаса.

# always_on_display_on
source: Display auto turn off disabled
ru: Автоматическое выключение дисплея отключено
uk: Автоматичне вимкнення дисплея вимкнено

# always_on_display_off
source: Display auto turn off enabled
ru: Автоматическое выключение дисплея включено
uk: Автоматичне вимикання дисплея увімкнено

source: Copied
ru: Скопировано
uk: Скопійовано

source: notes
uk: нотатки

# location_default_name
source: location
uk: локація
